---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.GetPresentationLayerAssignments
source: html/7dad2ed6-30a7-1b25-5e5f-8a1d7389f103.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.GetPresentationLayerAssignments Method

Get the list of the internally IfcPresentationLayerAssignments and their respective shape representations.

## Syntax (C#)
```csharp
public IDictionary<string, IList<IFCAnyHandle>> GetPresentationLayerAssignments()
```

## Returns
The map.